---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingNotConnected
source: html/047ab05f-0680-282d-63ad-59a5c16144d5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.RailingNotConnected Property

The Railing line must be a single connected Sketch. If you want separate pieces of Railing, create two or more separate Railings.

## Syntax (C#)
```csharp
public static FailureDefinitionId RailingNotConnected { get; }
```